README.md
- [how-might-we-strive-to-be-a-better-x](#sec-1)
  - [personal](#sec-1-1)
    - [servant-of-Rabb](#sec-1-1-1)
    - [family-contributor](#sec-1-1-2)
    - [polyglot-learner](#sec-1-1-3)
    - [real-world-development (startup-leader design-thinker engineer)](#sec-1-1-4)
  - [professional](#sec-1-2)
    - [computer-programming](#sec-1-2-1)
    - [software-system (design architecture)](#sec-1-2-2)
    - [full-stack-software-development](#sec-1-2-3)
    - [computer-science](#sec-1-2-4)
    - [artificial-intelligence machine-learning](#sec-1-2-5)
    - [behavioral-economics](#sec-1-2-6)
    - [helpful-tools](#sec-1-2-7)
    - [uncategorized](#sec-1-2-8)

# how-might-we-strive-to-be-a-better-x<a id="sec-1"></a>

## personal<a id="sec-1-1"></a>

### servant-of-Rabb<a id="sec-1-1-1"></a>

1.  reconnect-with-the-quran ([read](http://www.qtafsir.com/index.php) [read](https://archive.org/details/English-MaarifulQuran/page/n17) [listen](https://archive.org/details/TafseerOfQuranByNoumanAliKhan))

### family-contributor<a id="sec-1-1-2"></a>

1.  ([pregnancy baby toddler preschooler bigkid](https://www.babycenter.com/))

2.  [modern-resource-for-homeschooling](https://homeschoolbase.com/free-homeschool-curriculum/) ([edutech](https://homeschoolbase.com/100-best-educational-websites-2018/))

    1.  [khan-academy](https://www.khanacademy.org/)

    2.  [learning-lynx-classroom](https://sites.google.com/site/learninglynxclassroom/)

    3.  [pre-until-k12](https://www.education.com/)

    4.  [pbs-kids-for-parents](http://grownups.pbskids.org/)

3.  [taking-children-seriously](http://fallibleideas.com/taking-children-seriously)

### polyglot-learner<a id="sec-1-1-3"></a>

1.  [effective-learning](https://fs.blog/) (read [listen](https://fs.blog/the-knowledge-project/))

    1.  for-effective-action (teach innovate)

2.  ([business](https://www.npr.org/podcasts/510325/the-indicator-from-planet-money) ([alt](https://www.npr.org/podcasts/510313/how-i-built-this)) [economics](https://www.npr.org/podcasts/510289/planet-money))

3.  ([science technology engineering](http://omegataupodcast.net/) [mathematics](https://www.3blue1brown.com/))

4.  ([general](https://www.edge.org/) ([listen](https://www.edge.org/conversations)))

5.  helpful-tools ([productivity-music](https://www.youtube.com/user/cafemusicbgmchannel/videos))

### real-world-development (startup-leader design-thinker engineer)<a id="sec-1-1-4"></a>

1.  [real-world-development](https://www.worldbank.org/en/understanding-poverty) ([blog](http://blogs.worldbank.org/) [ict](https://blogs.worldbank.org/category/topics/information-and-communication-technologies) [weekly-digest](http://blogs.worldbank.org/category/tags/development-impact-links) [books](https://openknowledge.worldbank.org/handle/10986/4/discover))

2.  [startup](https://www.startupschool.org/library) ([alt](https://rework.withgoogle.com/))

3.  [design-thinking](https://dschool.stanford.edu/resources/design-thinking-bootleg) ([kit](http://www.designkit.org/) [design-sprint-kit](https://designsprintkit.withgoogle.com/introduction/overview))

4.  investment grant ([indonesia](https://angin.id/) [until-2020](https://www.expo2020dubai.com/expo-live/Innovation))

## professional<a id="sec-1-2"></a>

### computer-programming<a id="sec-1-2-1"></a>

1.  [programming-tasks](https://rosettacode.org/wiki/Category:Programming_Tasks) ([basic-language-learning](https://rosettacode.org/wiki/Category:Basic_language_learning) [per-category](https://rosettacode.org/wiki/Category:Solutions_by_Programming_Task) [my-personal-organized-content](https://github.com/fx2y/programming-tasks))

    1.  programming-languages ([go](https://github.com/enocom/gopher-reading-list/blob/master/README.md) [rust](https://github.com/brson/rust-anthology/blob/master/master-list.md) python [javascript](https://github.com/leonardomso/33-js-concepts/blob/master/README.md) kotlin swift clojure nim racket)

    2.  [quickstart](https://learnxinyminutes.com/)

2.  algorithms data-structures ([python](https://github.com/TheAlgorithms/Python) [javascript](https://github.com/trekhleb/javascript-algorithms/blob/master/README.md))

3.  [project-based-learning](https://github.com/tuvtran/project-based-learning/blob/master/README.md)  [build-your-own-x](https://github.com/danistefanovic/build-your-own-x/blob/master/README.md) [make-a-lisp](https://github.com/kanaka/mal)

4.  [my-personal-devbox](https://github.com/fx2y/devbox/blob/master/README.org)

5.  [git-flight-rules](https://github.com/k88hudson/git-flight-rules/blob/master/README.md)

6.  [cracking-the-coding-interview](https://www.amazon.com/dp/0984782850)

7.  [functional-programming](https://github.com/caiorss/Functional-Programming)

### software-system (design architecture)<a id="sec-1-2-2"></a>

1.  [design-patterns](https://github.com/DovAmir/awesome-design-patterns/blob/master/README.md)

    1.  go ([secure-coding-practice](https://checkmarx.gitbooks.io/go-scp/) [clean-arhitecture](https://github.com/bxcodec/go-clean-arch) [resiliency](https://github.com/eapache/go-resiliency))

    2.  javascript ([patterns](https://shichuan.github.io/javascript-patterns/) [design-patterns](https://tcorral.github.io/Design-Patterns-in-Javascript/) [modular](https://mjavascript.com/))

    3.  [architecture-of-open-source-app](http://www.aosabook.org/en/index.html)

    4.  [game-programming-patterns](http://gameprogrammingpatterns.com/contents.html)

    5.  [modern-software-architectural-pattern](https://github.com/Mahmoudz/Porto/blob/master/README.md)

2.  [the-system-design-primer](https://github.com/donnemartin/system-design-primer/blob/master/README.md)

3.  [distributed-systems](https://pdos.csail.mit.edu/6.824/schedule.html) ([papers](http://dsrg.pdos.csail.mit.edu/papers/))

4.  [(scalable available stable performant intelligent) system-design-patterns](https://github.com/binhnguyennus/awesome-scalability/blob/master/README.md) ([blog](https://martinfowler.com/))

    1.  [resilient-distributed-systems](https://github.com/Randommood/Strangeloop2015/blob/master/README.md)

### full-stack-software-development<a id="sec-1-2-3"></a>

1.  [quickstart](https://github.com/gothinkster/realworld/blob/master/README.md)

2.  [front-end-software-development](https://developer.mozilla.org/en-US/docs/Web) ([checklist](https://github.com/thedaviddias/Front-End-Checklist/blob/master/README.md))

    1.  [react](https://reactjs.org/docs/getting-started.html) ([tutorial](https://reactjs.org/tutorial/tutorial.html) [pattern](https://krasimir.gitbooks.io/react-in-patterns/content/) [pattern](https://vasanthk.gitbooks.io/react-bits/) [pattern](https://github.com/planningcenter/react-patterns/blob/master/README.md) [pattern](https://github.com/chantastic/reactpatterns/blob/master/README.markdown) [pattern](https://github.com/kentcdodds/advanced-react-patterns) [curated](https://github.com/enaqx/awesome-react/blob/master/README.md) [curated-component](https://github.com/brillout/awesome-react-components/blob/master/readme.md))

    2.  (ui ux) design ([ant-design](https://ant.design/docs/react/introduce) ([mobile](https://mobile.ant.design/docs/react/introduce) [pro](https://pro.ant.design/docs/getting-started)) [material-design-lite](https://getmdl.io/index.html))

    3.  [progressive-web-apps](https://developer.mozilla.org/en-US/docs/Web/Apps/Progressive) ([preact](https://preactjs.com/guide/getting-started)) ([curated](https://github.com/hemanth/awesome-pwa/blob/master/README.md))

    4.  (static server-side-rendering) ([nextjs](https://nextjs.org/learn/))

    5.  [graphql](https://www.howtographql.com/) ([apollo-client](https://www.apollographql.com/docs/react/))

    6.  [deployment](https://www.netlify.com/)

3.  mobile-software-development

    1.  native-apps ([flutter](https://flutter.io/docs/) [react-native](https://facebook.github.io/react-native/docs/getting-started) ([curated-component](https://github.com/madhavanmalolan/awesome-reactnative-ui/blob/master/README.md)))

4.  back-end-software-development

    1.  [asynchronous-http-microservices (zeit-micro)](https://github.com/amio/awesome-micro/blob/master/README.md)

    2.  node ([best-practice](http://thenodeway.io/) [best-practice](https://github.com/i0natan/nodebestpractices/blob/master/README.md))

    3.  [graphql-database-layer (prisma)](https://www.prisma.io/docs/)

    4.  databases ([interactive-tutorial](https://selectstarsql.com/))

        1.  relational (postgres mysql ms-sql oracle cockroach)

        2.  document (mongodb arangodb)

        3.  graph (neo4j dgraph neptune)

        4.  analytical (druid)

        5.  time-series (influxdb timescale)

        6.  key-value (cassandra dynamodb)

        7.  search (elastic-search)

        8.  in-memory (redis)

    5.  ([actor](https://actix.rs/book/actix/) [web](https://actix.rs/docs/)) framework-in-rust

5.  devops

    1.  global-serverless-deployments ([zeit-now](https://zeit.co/docs) ([example](https://github.com/zeit/now-examples) [curated](https://github.com/zeit/awesome-zeit/blob/master/readme.md)))

    2.  cloud-application-platform ([heroku](https://devcenter.heroku.com/) aws azure gcp)

    3.  cloud-native-engineering [cheatsheet](https://github.com/gofunct/cloudnative-engineer/blob/master/README.md)

    4.  [kubernetes](https://github.com/kelseyhightower/kubernetes-the-hard-way/blob/master/README.md) ([curated](https://github.com/ramitsurana/awesome-kubernetes) [interactive-tutorial](https://www.magicsandbox.com/))

6.  helpful-tools

    1.  [build-an-api](http://deployd.com/)

### computer-science<a id="sec-1-2-4"></a>

1.  [teach-yourself-computer-science](https://teachyourselfcs.com/)

2.  [papers](https://paperswelove.org/) ([with-code](https://github.com/zziz/pwc/blob/master/README.md))

3.  [cryptography](https://intensecrypto.org/public/) ([library](https://github.com/google/tink))

4.  security ([tools](https://github.com/maestron/botnets))

### artificial-intelligence machine-learning<a id="sec-1-2-5"></a>

1.  [artificial-intelligence](http://ai.berkeley.edu/course_schedule.html) [machine-learning](http://cs229.stanford.edu/syllabus.html) ([lectures](https://see.stanford.edu/Course/CS229/47))

2.  [machine-learning-mastery](https://machinelearningmastery.com/start-here/) ([tutorials](https://machinelearningmastery.com/blog/))

3.  [fast-ai](http://course.fast.ai)

4.  [kaggle](https://www.kaggle.com/learn/overview) ([dataset](https://www.kaggle.com/datasets))

5.  [dataset](https://news.ycombinator.com/item?id=17919297)

6.  [pytorch](https://github.com/bharathgs/Awesome-pytorch-list/blob/master/README.md)

7.  specialization

    1.  [machine-learning](https://github.com/Avik-Jain/100-Days-Of-ML-Code/blob/master/README.md) ([from-scratch](https://github.com/eriklindernoren/ML-From-Scratch))

    2.  [deep-learning](https://github.com/astorfi/Deep-Learning-World/blob/master/README.rst)

    3.  [deep-reinforcement-learning](https://github.com/andri27-ts/60_Days_RL_Challenge) ([framework](https://github.com/google/dopamine))

    4.  natural-language-processing (tools ([spacy](https://spacy.io/) [rasa](https://rasa.com/) [js-lib](https://github.com/axa-group/nlp.js)))

### behavioral-economics<a id="sec-1-2-6"></a>

1.  [incentives-in-computer-science](http://theory.stanford.edu/~tim/f18/f18.html)

    1.  twenty-lectures-on-algorithmic-game-theory

    2.  economics-and-computation

    3.  networks-crowds-and-markets

2.  [human-behavioral-biology](https://www.robertsapolskyrocks.com/hum-bio.html)

    1.  behave the-biology-of-humans-at-our-best-and-worst

    2.  chaos making-a-new-science

### helpful-tools<a id="sec-1-2-7"></a>

1.  [helpful-tools](https://github.com/ripienaar/free-for-dev/blob/master/README.md) ([alt](https://github.com/cjbarber/ToolsOfTheTrade/blob/master/readme.md))

### uncategorized<a id="sec-1-2-8"></a>

1.  [curated-github-trending](https://github.com/vitalets/github-trending-repos)

2.  interesting-projects

    1.  [open-match](https://github.com/GoogleCloudPlatform/open-match)

    2.  [declarative-web-scraping](https://github.com/montferret/ferret)

    3.  [modern-editor](https://github.com/xi-editor/xi-editor)

    4.  [secure-p2p-transfer](https://github.com/schollz/croc)

    5.  [modern-operating-system](https://fuchsia.googlesource.com/)
